[
  {
    "id": 1,
    "category": "Cleansing & Purity",
    "prayerPoint": "Lord, create in me a clean heart and renew a right spirit within me. Wash me thoroughly from my iniquity and cleanse me from my sin.",
    "scripture": "Create in me a clean heart, O God; and renew a right spirit within me.",
    "reference": "Psalm 51:10"
  },
  {
    "id": 2,
    "category": "Cleansing & Purity",
    "prayerPoint": "Father, I ask that You would purify my heart and mind. Help me to pursue purity in all areas of my life.",
    "scripture": "Blessed are the pure in heart: for they shall see God.",
    "reference": "Matthew 5:8"
  },
  {
    "id": 3,
    "category": "Cleansing & Purity",
    "prayerPoint": "Lord, help me to fix my thoughts on what is true, honorable, right, pure, lovely, and admirable.",
    "scripture": "Finally, brethren, whatsoever things are true, whatsoever things are honest, whatsoever things are just, whatsoever things are pure, whatsoever things are lovely, whatsoever things are of good report; if there be any virtue, and if there be any praise, think on these things.",
    "reference": "Philippians 4:8"
  },
  {
    "id": 4,
    "category": "Cleansing & Purity",
    "prayerPoint": "Father, cleanse me from all filthiness of the flesh and spirit, and help me to perfect holiness in Your fear.",
    "scripture": "Having therefore these promises, dearly beloved, let us cleanse ourselves from all filthiness of the flesh and spirit, perfecting holiness in the fear of God.",
    "reference": "2 Corinthians 7:1"
  },
  {
    "id": 5,
    "category": "Cleansing & Purity",
    "prayerPoint": "Lord, wash me, and I shall be whiter than snow. Purge me with hyssop and I shall be clean.",
    "scripture": "Purge me with hyssop, and I shall be clean: wash me, and I shall be whiter than snow.",
    "reference": "Psalm 51:7"
  },
  {
    "id": 6,
    "category": "Deliverance & Freedom",
    "prayerPoint": "Jesus, You said that whom the Son sets free is free indeed. I receive my freedom from this bondage in Your name.",
    "scripture": "If the Son therefore shall make you free, ye shall be free indeed.",
    "reference": "John 8:36"
  },
  {
    "id": 7,
    "category": "Deliverance & Freedom",
    "prayerPoint": "Father, deliver me from every evil work and preserve me for Your heavenly kingdom.",
    "scripture": "And the Lord shall deliver me from every evil work, and will preserve me unto his heavenly kingdom: to whom be glory for ever and ever. Amen.",
    "reference": "2 Timothy 4:18"
  },
  {
    "id": 8,
    "category": "Deliverance & Freedom",
    "prayerPoint": "Lord, I stand in the liberty by which Christ has made me free. I refuse to be entangled again with the yoke of bondage.",
    "scripture": "Stand fast therefore in the liberty wherewith Christ hath made us free, and be not entangled again with the yoke of bondage.",
    "reference": "Galatians 5:1"
  },
  {
    "id": 9,
    "category": "Deliverance & Freedom",
    "prayerPoint": "God, I know that where the Spirit of the Lord is, there is liberty. Set me free by Your Spirit.",
    "scripture": "Now the Lord is that Spirit: and where the Spirit of the Lord is, there is liberty.",
    "reference": "2 Corinthians 3:17"
  },
  {
    "id": 10,
    "category": "Deliverance & Freedom",
    "prayerPoint": "Father, break every chain of addiction and bondage in my life. Let Your truth make me free.",
    "scripture": "And ye shall know the truth, and the truth shall make you free.",
    "reference": "John 8:32"
  },
  {
    "id": 11,
    "category": "Strength & Resistance",
    "prayerPoint": "Lord, You promised a way of escape from every temptation. Show me the way out and give me strength to take it.",
    "scripture": "There hath no temptation taken you but such as is common to man: but God is faithful, who will not suffer you to be tempted above that ye are able; but will with the temptation also make a way to escape, that ye may be able to bear it.",
    "reference": "1 Corinthians 10:13"
  },
  {
    "id": 12,
    "category": "Strength & Resistance",
    "prayerPoint": "Father, I submit myself to You. Help me to resist the devil so that he will flee from me.",
    "scripture": "Submit yourselves therefore to God. Resist the devil, and he will flee from you.",
    "reference": "James 4:7"
  },
  {
    "id": 13,
    "category": "Strength & Resistance",
    "prayerPoint": "Lord, strengthen me with might by Your Spirit in my inner man, that I may stand firm against temptation.",
    "scripture": "That he would grant you, according to the riches of his glory, to be strengthened with might by his Spirit in the inner man.",
    "reference": "Ephesians 3:16"
  },
  {
    "id": 14,
    "category": "Strength & Resistance",
    "prayerPoint": "God, I can do all things through Christ who strengthens me. Give me the power to overcome this weakness.",
    "scripture": "I can do all things through Christ which strengtheneth me.",
    "reference": "Philippians 4:13"
  },
  {
    "id": 15,
    "category": "Strength & Resistance",
    "prayerPoint": "Father, help me to put on the full armor of God so I can stand against the schemes of the devil.",
    "scripture": "Put on the whole armour of God, that ye may be able to stand against the wiles of the devil.",
    "reference": "Ephesians 6:11"
  },
  {
    "id": 16,
    "category": "Strength & Resistance",
    "prayerPoint": "Lord, help me to flee youthful lusts and pursue righteousness, faith, love, and peace.",
    "scripture": "Flee also youthful lusts: but follow righteousness, faith, charity, peace, with them that call on the Lord out of a pure heart.",
    "reference": "2 Timothy 2:22"
  },
  {
    "id": 17,
    "category": "Forgiveness & Grace",
    "prayerPoint": "Father, I confess my sins to You. Forgive me and cleanse me from all unrighteousness.",
    "scripture": "If we confess our sins, he is faithful and just to forgive us our sins, and to cleanse us from all unrighteousness.",
    "reference": "1 John 1:9"
  },
  {
    "id": 18,
    "category": "Forgiveness & Grace",
    "prayerPoint": "Lord, I thank You that there is no condemnation for those who are in Christ Jesus.",
    "scripture": "There is therefore now no condemnation to them which are in Christ Jesus, who walk not after the flesh, but after the Spirit.",
    "reference": "Romans 8:1"
  },
  {
    "id": 19,
    "category": "Forgiveness & Grace",
    "prayerPoint": "God, Your grace is sufficient for me. Your strength is made perfect in my weakness.",
    "scripture": "And he said unto me, My grace is sufficient for thee: for my strength is made perfect in weakness.",
    "reference": "2 Corinthians 12:9"
  },
  {
    "id": 20,
    "category": "Forgiveness & Grace",
    "prayerPoint": "Father, as far as the east is from the west, so far have You removed my transgressions from me.",
    "scripture": "As far as the east is from the west, so far hath he removed our transgressions from us.",
    "reference": "Psalm 103:12"
  },
  {
    "id": 21,
    "category": "Forgiveness & Grace",
    "prayerPoint": "Lord, help me to receive Your mercy and find grace to help in my time of need.",
    "scripture": "Let us therefore come boldly unto the throne of grace, that we may obtain mercy, and find grace to help in time of need.",
    "reference": "Hebrews 4:16"
  },
  {
    "id": 22,
    "category": "Renewal & Restoration",
    "prayerPoint": "Father, restore to me the joy of Your salvation and uphold me with Your willing Spirit.",
    "scripture": "Restore unto me the joy of thy salvation; and uphold me with thy free spirit.",
    "reference": "Psalm 51:12"
  },
  {
    "id": 23,
    "category": "Renewal & Restoration",
    "prayerPoint": "Lord, help me to be transformed by the renewing of my mind, that I may prove Your good and perfect will.",
    "scripture": "And be not conformed to this world: but be ye transformed by the renewing of your mind, that ye may prove what is that good, and acceptable, and perfect, will of God.",
    "reference": "Romans 12:2"
  },
  {
    "id": 24,
    "category": "Renewal & Restoration",
    "prayerPoint": "God, make me a new creation in Christ. Let the old things pass away and all things become new.",
    "scripture": "Therefore if any man be in Christ, he is a new creature: old things are passed away; behold, all things are become new.",
    "reference": "2 Corinthians 5:17"
  },
  {
    "id": 25,
    "category": "Renewal & Restoration",
    "prayerPoint": "Father, renew a steadfast spirit within me and keep me from falling back into my old ways.",
    "scripture": "Create in me a clean heart, O God; and renew a right spirit within me.",
    "reference": "Psalm 51:10"
  },
  {
    "id": 26,
    "category": "Renewal & Restoration",
    "prayerPoint": "Lord, help me to put off my old self and put on the new self, created to be like God in true righteousness and holiness.",
    "scripture": "And that ye put on the new man, which after God is created in righteousness and true holiness.",
    "reference": "Ephesians 4:24"
  },
  {
    "id": 27,
    "category": "Spiritual Warfare",
    "prayerPoint": "Father, help me to take every thought captive to the obedience of Christ and cast down imaginations.",
    "scripture": "Casting down imaginations, and every high thing that exalteth itself against the knowledge of God, and bringing into captivity every thought to the obedience of Christ.",
    "reference": "2 Corinthians 10:5"
  },
  {
    "id": 28,
    "category": "Spiritual Warfare",
    "prayerPoint": "Lord, I know my battle is not against flesh and blood but against spiritual forces. Equip me for this warfare.",
    "scripture": "For we wrestle not against flesh and blood, but against principalities, against powers, against the rulers of the darkness of this world, against spiritual wickedness in high places.",
    "reference": "Ephesians 6:12"
  },
  {
    "id": 29,
    "category": "Spiritual Warfare",
    "prayerPoint": "God, give me the sword of the Spirit, which is Your Word, to fight against every temptation.",
    "scripture": "And take the helmet of salvation, and the sword of the Spirit, which is the word of God.",
    "reference": "Ephesians 6:17"
  },
  {
    "id": 30,
    "category": "Spiritual Warfare",
    "prayerPoint": "Father, greater is He who is in me than he who is in the world. Give me victory through Your power.",
    "scripture": "Ye are of God, little children, and have overcome them: because greater is he that is in you, than he that is in the world.",
    "reference": "1 John 4:4"
  },
  {
    "id": 31,
    "category": "Spiritual Warfare",
    "prayerPoint": "Lord, help me to be sober and vigilant because my adversary the devil walks about seeking whom he may devour.",
    "scripture": "Be sober, be vigilant; because your adversary the devil, as a roaring lion, walketh about, seeking whom he may devour.",
    "reference": "1 Peter 5:8"
  },
  {
    "id": 32,
    "category": "Strength & Resistance",
    "prayerPoint": "Father, help me to walk in the Spirit so that I will not fulfill the lust of the flesh.",
    "scripture": "This I say then, Walk in the Spirit, and ye shall not fulfil the lust of the flesh.",
    "reference": "Galatians 5:16"
  },
  {
    "id": 33,
    "category": "Cleansing & Purity",
    "prayerPoint": "Lord, let me be a vessel of honor, sanctified and useful for the Master, prepared for every good work.",
    "scripture": "If a man therefore purge himself from these, he shall be a vessel unto honour, sanctified, and meet for the master's use, and prepared unto every good work.",
    "reference": "2 Timothy 2:21"
  },
  {
    "id": 34,
    "category": "Deliverance & Freedom",
    "prayerPoint": "God, You have not given me a spirit of fear, but of power, love, and a sound mind.",
    "scripture": "For God hath not given us the spirit of fear; but of power, and of love, and of a sound mind.",
    "reference": "2 Timothy 1:7"
  },
  {
    "id": 35,
    "category": "Strength & Resistance",
    "prayerPoint": "Father, help me to keep my eyes on things above, not on earthly things that lead me astray.",
    "scripture": "Set your affection on things above, not on things on the earth.",
    "reference": "Colossians 3:2"
  },
  {
    "id": 36,
    "category": "Forgiveness & Grace",
    "prayerPoint": "Lord, I will not let sin reign in my mortal body. Help me to present myself to You as an instrument of righteousness.",
    "scripture": "Let not sin therefore reign in your mortal body, that ye should obey it in the lusts thereof.",
    "reference": "Romans 6:12"
  },
  {
    "id": 37,
    "category": "Renewal & Restoration",
    "prayerPoint": "God, Your mercies are new every morning. Great is Your faithfulness toward me.",
    "scripture": "It is of the LORD's mercies that we are not consumed, because his compassions fail not. They are new every morning: great is thy faithfulness.",
    "reference": "Lamentations 3:22-23"
  },
  {
    "id": 38,
    "category": "Spiritual Warfare",
    "prayerPoint": "Father, I overcome evil with good. Help me to focus on what is right and pure in Your sight.",
    "scripture": "Be not overcome of evil, but overcome evil with good.",
    "reference": "Romans 12:21"
  },
  {
    "id": 39,
    "category": "Cleansing & Purity",
    "prayerPoint": "Lord, help me to abstain from fleshly lusts which war against my soul.",
    "scripture": "Dearly beloved, I beseech you as strangers and pilgrims, abstain from fleshly lusts, which war against the soul.",
    "reference": "1 Peter 2:11"
  },
  {
    "id": 40,
    "category": "Deliverance & Freedom",
    "prayerPoint": "Father, call upon You in the day of trouble, and You will deliver me, and I shall glorify You.",
    "scripture": "And call upon me in the day of trouble: I will deliver thee, and thou shalt glorify me.",
    "reference": "Psalm 50:15"
  },
  {
    "id": 41,
    "category": "Strength & Resistance",
    "prayerPoint": "Lord, help me to make no provision for the flesh to fulfill its lusts.",
    "scripture": "But put ye on the Lord Jesus Christ, and make not provision for the flesh, to fulfil the lusts thereof.",
    "reference": "Romans 13:14"
  },
  {
    "id": 42,
    "category": "Forgiveness & Grace",
    "prayerPoint": "God, You are faithful and just. I trust in Your promise to forgive and cleanse me.",
    "scripture": "If we confess our sins, he is faithful and just to forgive us our sins, and to cleanse us from all unrighteousness.",
    "reference": "1 John 1:9"
  },
  {
    "id": 43,
    "category": "Renewal & Restoration",
    "prayerPoint": "Father, help me to forget what is behind and strain toward what is ahead, pressing on toward the goal.",
    "scripture": "Brethren, I count not myself to have apprehended: but this one thing I do, forgetting those things which are behind, and reaching forth unto those things which are before.",
    "reference": "Philippians 3:13"
  },
  {
    "id": 44,
    "category": "Spiritual Warfare",
    "prayerPoint": "Lord, no weapon formed against me shall prosper. I stand on Your promises.",
    "scripture": "No weapon that is formed against thee shall prosper; and every tongue that shall rise against thee in judgment thou shalt condemn.",
    "reference": "Isaiah 54:17"
  },
  {
    "id": 45,
    "category": "Cleansing & Purity",
    "prayerPoint": "Father, help me to keep myself pure and set apart for Your glory.",
    "scripture": "Keep thyself pure.",
    "reference": "1 Timothy 5:22"
  },
  {
    "id": 46,
    "category": "Deliverance & Freedom",
    "prayerPoint": "Lord, You are my rock, my fortress, and my deliverer. In You I take refuge.",
    "scripture": "The LORD is my rock, and my fortress, and my deliverer; my God, my strength, in whom I will trust.",
    "reference": "Psalm 18:2"
  },
  {
    "id": 47,
    "category": "Strength & Resistance",
    "prayerPoint": "God, help me to stand firm and not be moved by temptation. Let my labor in the Lord not be in vain.",
    "scripture": "Therefore, my beloved brethren, be ye stedfast, unmoveable, always abounding in the work of the Lord.",
    "reference": "1 Corinthians 15:58"
  },
  {
    "id": 48,
    "category": "Forgiveness & Grace",
    "prayerPoint": "Father, blot out my transgressions according to Your unfailing love and great compassion.",
    "scripture": "Have mercy upon me, O God, according to thy lovingkindness: according unto the multitude of thy tender mercies blot out my transgressions.",
    "reference": "Psalm 51:1"
  },
  {
    "id": 49,
    "category": "Renewal & Restoration",
    "prayerPoint": "Lord, I wait on You to renew my strength. Help me to mount up with wings like eagles.",
    "scripture": "But they that wait upon the LORD shall renew their strength; they shall mount up with wings as eagles; they shall run, and not be weary; and they shall walk, and not faint.",
    "reference": "Isaiah 40:31"
  },
  {
    "id": 50,
    "category": "Spiritual Warfare",
    "prayerPoint": "Father, I am more than a conqueror through Him who loved me. Help me to walk in victory.",
    "scripture": "Nay, in all these things we are more than conquerors through him that loved us.",
    "reference": "Romans 8:37"
  }
]
