[
  {
    "id": 1,
    "category": "Limpieza y Pureza",
    "prayerPoint": "Señor, crea en mí un corazón limpio y renueva un espíritu recto dentro de mí. Lávame completamente de mi iniquidad y límpiame de mi pecado.",
    "scripture": "Crea en mí un corazón limpio, oh Dios; y renueva un espíritu recto dentro de mí.",
    "reference": "Salmo 51:10"
  },
  {
    "id": 2,
    "category": "Limpieza y Pureza",
    "prayerPoint": "Padre, te pido que purifiques mi corazón y mi mente. Ayúdame a buscar la pureza en todas las áreas de mi vida.",
    "scripture": "Bienaventurados los de limpio corazón: porque ellos verán a Dios.",
    "reference": "Mateo 5:8"
  },
  {
    "id": 3,
    "category": "Limpieza y Pureza",
    "prayerPoint": "Señor, ayúdame a fijar mis pensamientos en lo que es verdadero, honesto, justo, puro, amable y de buen nombre.",
    "scripture": "Por lo demás, hermanos, todo lo que es verdadero, todo lo honesto, todo lo justo, todo lo puro, todo lo amable, todo lo que es de buen nombre; si hay virtud alguna, si alguna alabanza, en esto pensad.",
    "reference": "Filipenses 4:8"
  },
  {
    "id": 4,
    "category": "Limpieza y Pureza",
    "prayerPoint": "Padre, límpiame de toda inmundicia de la carne y del espíritu, y ayúdame a perfeccionar la santidad en tu temor.",
    "scripture": "Así que, amados, pues tenemos tales promesas, limpiémonos de toda inmundicia de carne y de espíritu, perfeccionando la santidad en el temor de Dios.",
    "reference": "2 Corintios 7:1"
  },
  {
    "id": 5,
    "category": "Limpieza y Pureza",
    "prayerPoint": "Señor, lávame, y seré más blanco que la nieve. Purifícame con hisopo y seré limpio.",
    "scripture": "Purifícame con hisopo, y seré limpio: lávame, y seré más blanco que la nieve.",
    "reference": "Salmo 51:7"
  },
  {
    "id": 6,
    "category": "Liberación y Libertad",
    "prayerPoint": "Jesús, dijiste que a quien el Hijo libertare, será verdaderamente libre. Recibo mi libertad de esta esclavitud en tu nombre.",
    "scripture": "Así que, si el Hijo os libertare, seréis verdaderamente libres.",
    "reference": "Juan 8:36"
  },
  {
    "id": 7,
    "category": "Liberación y Libertad",
    "prayerPoint": "Padre, líbrame de toda obra mala y guárdame para tu reino celestial.",
    "scripture": "Y el Señor me librará de toda obra mala, y me preservará para su reino celestial: a él sea gloria por los siglos de los siglos. Amén.",
    "reference": "2 Timoteo 4:18"
  },
  {
    "id": 8,
    "category": "Liberación y Libertad",
    "prayerPoint": "Señor, estoy firme en la libertad con que Cristo nos hizo libres. Rehúso ser enredado otra vez con el yugo de esclavitud.",
    "scripture": "Estad, pues, firmes en la libertad con que Cristo nos hizo libres, y no volváis otra vez a ser presos en el yugo de servidumbre.",
    "reference": "Gálatas 5:1"
  },
  {
    "id": 9,
    "category": "Liberación y Libertad",
    "prayerPoint": "Dios, sé que donde está el Espíritu del Señor, allí hay libertad. Ponme en libertad por tu Espíritu.",
    "scripture": "Porque el Señor es el Espíritu: y donde hay el Espíritu del Señor, allí hay libertad.",
    "reference": "2 Corintios 3:17"
  },
  {
    "id": 10,
    "category": "Liberación y Libertad",
    "prayerPoint": "Padre, rompe toda cadena de adicción y esclavitud en mi vida. Que tu verdad me haga libre.",
    "scripture": "Y conoceréis la verdad, y la verdad os hará libres.",
    "reference": "Juan 8:32"
  },
  {
    "id": 11,
    "category": "Fuerza y Resistencia",
    "prayerPoint": "Señor, prometiste una salida de toda tentación. Muéstrame el camino de escape y dame fuerzas para tomarlo.",
    "scripture": "No os ha tomado tentación, sino humana: mas fiel es Dios, que no os dejará ser tentados más de lo que podéis llevar; antes dará también juntamente con la tentación la salida, para que podáis aguantar.",
    "reference": "1 Corintios 10:13"
  },
  {
    "id": 12,
    "category": "Fuerza y Resistencia",
    "prayerPoint": "Padre, me someto a ti. Ayúdame a resistir al diablo para que huya de mí.",
    "scripture": "Someteos pues a Dios: resistid al diablo, y de vosotros huirá.",
    "reference": "Santiago 4:7"
  },
  {
    "id": 13,
    "category": "Fuerza y Resistencia",
    "prayerPoint": "Señor, fortaléceme con potencia en el hombre interior por tu Espíritu, para que pueda estar firme contra la tentación.",
    "scripture": "Que os dé, conforme a las riquezas de su gloria, el ser corroborados con potencia en el hombre interior por su Espíritu.",
    "reference": "Efesios 3:16"
  },
  {
    "id": 14,
    "category": "Fuerza y Resistencia",
    "prayerPoint": "Dios, todo lo puedo en Cristo que me fortalece. Dame el poder para vencer esta debilidad.",
    "scripture": "Todo lo puedo en Cristo que me fortalece.",
    "reference": "Filipenses 4:13"
  },
  {
    "id": 15,
    "category": "Fuerza y Resistencia",
    "prayerPoint": "Padre, ayúdame a vestirme de toda la armadura de Dios para poder estar firme contra las asechanzas del diablo.",
    "scripture": "Vestíos de toda la armadura de Dios, para que podáis estar firmes contra las asechanzas del diablo.",
    "reference": "Efesios 6:11"
  },
  {
    "id": 16,
    "category": "Fuerza y Resistencia",
    "prayerPoint": "Señor, ayúdame a huir de las pasiones juveniles y seguir la justicia, la fe, el amor y la paz.",
    "scripture": "Huye también de las pasiones juveniles, y sigue la justicia, la fe, la caridad, la paz, con los que invocan al Señor de puro corazón.",
    "reference": "2 Timoteo 2:22"
  },
  {
    "id": 17,
    "category": "Perdón y Gracia",
    "prayerPoint": "Padre, confieso mis pecados a ti. Perdóname y límpiame de toda maldad.",
    "scripture": "Si confesamos nuestros pecados, él es fiel y justo para que nos perdone nuestros pecados, y nos limpie de toda maldad.",
    "reference": "1 Juan 1:9"
  },
  {
    "id": 18,
    "category": "Perdón y Gracia",
    "prayerPoint": "Señor, te doy gracias porque ninguna condenación hay para los que están en Cristo Jesús.",
    "scripture": "Ahora pues, ninguna condenación hay para los que están en Cristo Jesús, los que no andan conforme a la carne, mas conforme al espíritu.",
    "reference": "Romanos 8:1"
  },
  {
    "id": 19,
    "category": "Perdón y Gracia",
    "prayerPoint": "Dios, tu gracia es suficiente para mí. Tu poder se perfecciona en mi debilidad.",
    "scripture": "Y me ha dicho: Bástate mi gracia; porque mi potencia en la flaqueza se perfecciona.",
    "reference": "2 Corintios 12:9"
  },
  {
    "id": 20,
    "category": "Perdón y Gracia",
    "prayerPoint": "Padre, cuanto está lejos el oriente del occidente, hiciste alejar de mí mis rebeliones.",
    "scripture": "Cuanto está lejos el oriente del occidente, hizo alejar de nosotros nuestras rebeliones.",
    "reference": "Salmo 103:12"
  },
  {
    "id": 21,
    "category": "Perdón y Gracia",
    "prayerPoint": "Señor, ayúdame a recibir tu misericordia y hallar gracia para el oportuno socorro.",
    "scripture": "Lleguémonos pues confiadamente al trono de la gracia, para alcanzar misericordia, y hallar gracia para el oportuno socorro.",
    "reference": "Hebreos 4:16"
  },
  {
    "id": 22,
    "category": "Renovación y Restauración",
    "prayerPoint": "Padre, restitúyeme el gozo de tu salvación y espíritu noble me sustente.",
    "scripture": "Restitúyeme el gozo de tu salvación: y el espíritu libre me sustente.",
    "reference": "Salmo 51:12"
  },
  {
    "id": 23,
    "category": "Renovación y Restauración",
    "prayerPoint": "Señor, ayúdame a ser transformado por la renovación de mi entendimiento, para comprobar tu buena voluntad.",
    "scripture": "Y no os conforméis a este siglo; mas reformaos por la renovación de vuestro entendimiento, para que experimentéis cuál sea la buena voluntad de Dios, agradable y perfecta.",
    "reference": "Romanos 12:2"
  },
  {
    "id": 24,
    "category": "Renovación y Restauración",
    "prayerPoint": "Dios, hazme una nueva criatura en Cristo. Que las cosas viejas pasen y todas sean hechas nuevas.",
    "scripture": "De modo que si alguno está en Cristo, nueva criatura es: las cosas viejas pasaron; he aquí todas son hechas nuevas.",
    "reference": "2 Corintios 5:17"
  },
  {
    "id": 25,
    "category": "Renovación y Restauración",
    "prayerPoint": "Padre, renueva un espíritu recto dentro de mí y guárdame de volver a mis viejos caminos.",
    "scripture": "Crea en mí un corazón limpio, oh Dios; y renueva un espíritu recto dentro de mí.",
    "reference": "Salmo 51:10"
  },
  {
    "id": 26,
    "category": "Renovación y Restauración",
    "prayerPoint": "Señor, ayúdame a despojarme del viejo hombre y revestirme del nuevo, creado según Dios en justicia y santidad.",
    "scripture": "Y vestíos del nuevo hombre, que es criado conforme a Dios en justicia y en santidad de verdad.",
    "reference": "Efesios 4:24"
  },
  {
    "id": 27,
    "category": "Guerra Espiritual",
    "prayerPoint": "Padre, ayúdame a llevar cautivo todo pensamiento a la obediencia de Cristo y derribar argumentos.",
    "scripture": "Destruyendo consejos, y toda altura que se levanta contra la ciencia de Dios, y cautivando todo intento a la obediencia de Cristo.",
    "reference": "2 Corintios 10:5"
  },
  {
    "id": 28,
    "category": "Guerra Espiritual",
    "prayerPoint": "Señor, sé que mi lucha no es contra sangre y carne, sino contra huestes espirituales. Equípame para esta guerra.",
    "scripture": "Porque no tenemos lucha contra sangre y carne; sino contra principados, contra potestades, contra señores del mundo, gobernadores de estas tinieblas, contra malicias espirituales en los aires.",
    "reference": "Efesios 6:12"
  },
  {
    "id": 29,
    "category": "Guerra Espiritual",
    "prayerPoint": "Dios, dame la espada del Espíritu, que es tu Palabra, para luchar contra toda tentación.",
    "scripture": "Y tomad el yelmo de salud, y la espada del Espíritu; que es la palabra de Dios.",
    "reference": "Efesios 6:17"
  },
  {
    "id": 30,
    "category": "Guerra Espiritual",
    "prayerPoint": "Padre, mayor es el que está en mí que el que está en el mundo. Dame victoria por tu poder.",
    "scripture": "Hijitos, vosotros sois de Dios, y los habéis vencido; porque el que en vosotros está, es mayor que el que está en el mundo.",
    "reference": "1 Juan 4:4"
  },
  {
    "id": 31,
    "category": "Guerra Espiritual",
    "prayerPoint": "Señor, ayúdame a ser sobrio y vigilante porque mi adversario el diablo anda buscando a quien devorar.",
    "scripture": "Sed templados, y velad; porque vuestro adversario el diablo, cual león rugiente, anda alrededor buscando a quien devore.",
    "reference": "1 Pedro 5:8"
  },
  {
    "id": 32,
    "category": "Fuerza y Resistencia",
    "prayerPoint": "Padre, ayúdame a andar en el Espíritu para que no satisfaga los deseos de la carne.",
    "scripture": "Digo pues: Andad en el Espíritu, y no satisfagáis los deseos de la carne.",
    "reference": "Gálatas 5:16"
  },
  {
    "id": 33,
    "category": "Limpieza y Pureza",
    "prayerPoint": "Señor, permíteme ser un vaso de honra, santificado y útil para el Señor, preparado para toda buena obra.",
    "scripture": "Así que, si alguno se limpiare de estas cosas, será vaso para honra, santificado, y útil para los usos del Señor, y aparejado para toda buena obra.",
    "reference": "2 Timoteo 2:21"
  },
  {
    "id": 34,
    "category": "Liberación y Libertad",
    "prayerPoint": "Dios, no me has dado espíritu de cobardía, sino de fortaleza, amor y dominio propio.",
    "scripture": "Porque no nos ha dado Dios el espíritu de temor, sino el de fortaleza, y de amor, y de templanza.",
    "reference": "2 Timoteo 1:7"
  },
  {
    "id": 35,
    "category": "Fuerza y Resistencia",
    "prayerPoint": "Padre, ayúdame a poner la mira en las cosas de arriba, no en las de la tierra que me desvían.",
    "scripture": "Poned la mira en las cosas de arriba, no en las de la tierra.",
    "reference": "Colosenses 3:2"
  },
  {
    "id": 36,
    "category": "Perdón y Gracia",
    "prayerPoint": "Señor, no permitiré que el pecado reine en mi cuerpo mortal. Ayúdame a presentarme a ti como instrumento de justicia.",
    "scripture": "No reine, pues, el pecado en vuestro cuerpo mortal, para que le obedezcáis en sus concupiscencias.",
    "reference": "Romanos 6:12"
  },
  {
    "id": 37,
    "category": "Renovación y Restauración",
    "prayerPoint": "Dios, tus misericordias son nuevas cada mañana. Grande es tu fidelidad.",
    "scripture": "Por la misericordia de Jehová no hemos sido consumidos, porque nunca decayeron sus misericordias. Nuevas son cada mañana; grande es tu fidelidad.",
    "reference": "Lamentaciones 3:22-23"
  },
  {
    "id": 38,
    "category": "Guerra Espiritual",
    "prayerPoint": "Padre, venzo el mal con el bien. Ayúdame a enfocarme en lo que es recto y puro delante de ti.",
    "scripture": "No seas vencido de lo malo; mas vence con el bien el mal.",
    "reference": "Romanos 12:21"
  },
  {
    "id": 39,
    "category": "Limpieza y Pureza",
    "prayerPoint": "Señor, ayúdame a abstenerme de los deseos carnales que batallan contra el alma.",
    "scripture": "Amados, yo os ruego como a extranjeros y peregrinos, os abstengáis de los deseos carnales que batallan contra el alma.",
    "reference": "1 Pedro 2:11"
  },
  {
    "id": 40,
    "category": "Liberación y Libertad",
    "prayerPoint": "Padre, invoco tu nombre en el día de la angustia, y tú me librarás, y yo te glorificaré.",
    "scripture": "E invócame en el día de la angustia: libraréte, y tú me honrarás.",
    "reference": "Salmo 50:15"
  },
  {
    "id": 41,
    "category": "Fuerza y Resistencia",
    "prayerPoint": "Señor, ayúdame a no proveer para la carne en sus concupiscencias.",
    "scripture": "Mas vestíos del Señor Jesucristo, y no hagáis caso de la carne en sus deseos.",
    "reference": "Romanos 13:14"
  },
  {
    "id": 42,
    "category": "Perdón y Gracia",
    "prayerPoint": "Dios, eres fiel y justo. Confío en tu promesa de perdonarme y limpiarme.",
    "scripture": "Si confesamos nuestros pecados, él es fiel y justo para que nos perdone nuestros pecados, y nos limpie de toda maldad.",
    "reference": "1 Juan 1:9"
  },
  {
    "id": 43,
    "category": "Renovación y Restauración",
    "prayerPoint": "Padre, ayúdame a olvidar lo que queda atrás y extenderme a lo que está delante, prosiguiendo a la meta.",
    "scripture": "Hermanos, yo mismo no hago cuenta de haberlo ya alcanzado: pero una cosa hago: olvidando ciertamente lo que queda atrás, y extendiéndome a lo que está delante.",
    "reference": "Filipenses 3:13"
  },
  {
    "id": 44,
    "category": "Guerra Espiritual",
    "prayerPoint": "Señor, ninguna arma forjada contra mí prosperará. Me paro sobre tus promesas.",
    "scripture": "Ninguna arma forjada contra ti, prosperará; y tú condenarás toda lengua que se levantare contra ti en juicio.",
    "reference": "Isaías 54:17"
  },
  {
    "id": 45,
    "category": "Limpieza y Pureza",
    "prayerPoint": "Padre, ayúdame a mantenerme puro y apartado para tu gloria.",
    "scripture": "Consérvate en limpieza.",
    "reference": "1 Timoteo 5:22"
  },
  {
    "id": 46,
    "category": "Liberación y Libertad",
    "prayerPoint": "Señor, tú eres mi roca, mi fortaleza y mi libertador. En ti me refugio.",
    "scripture": "Jehová, roca mía, y castillo mío, y mi libertador; Dios mío, fuerte mío, en él confiaré.",
    "reference": "Salmo 18:2"
  },
  {
    "id": 47,
    "category": "Fuerza y Resistencia",
    "prayerPoint": "Dios, ayúdame a estar firme y no ser movido por la tentación. Que mi trabajo en el Señor no sea en vano.",
    "scripture": "Así que, hermanos míos amados, estad firmes y constantes, creciendo en la obra del Señor siempre.",
    "reference": "1 Corintios 15:58"
  },
  {
    "id": 48,
    "category": "Perdón y Gracia",
    "prayerPoint": "Padre, borra mis rebeliones conforme a tu misericordia y gran compasión.",
    "scripture": "Ten piedad de mí, oh Dios, conforme a tu misericordia: conforme a la multitud de tus piedades borra mis rebeliones.",
    "reference": "Salmo 51:1"
  },
  {
    "id": 49,
    "category": "Renovación y Restauración",
    "prayerPoint": "Señor, espero en ti para que renueves mis fuerzas. Ayúdame a levantarme con alas como las águilas.",
    "scripture": "Mas los que esperan a Jehová tendrán nuevas fuerzas; levantarán las alas como águilas, correrán y no se cansarán, caminarán y no se fatigarán.",
    "reference": "Isaías 40:31"
  },
  {
    "id": 50,
    "category": "Guerra Espiritual",
    "prayerPoint": "Padre, soy más que vencedor por medio de Aquel que me amó. Ayúdame a caminar en victoria.",
    "scripture": "Antes, en todas estas cosas hacemos más que vencer por medio de aquel que nos amó.",
    "reference": "Romanos 8:37"
  }
]
